<a href="https://colab.research.google.com/github/AXN-1/Pandas-Data-Cleaning-Project/blob/main/data_cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [29]:
import pandas as pd
df=pd.read_csv("Bad_Data.csv")

In [30]:
df.head(5)

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India

In [31]:
df.tail()

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,M,53.0,bangalore,2023-12-31,2025-05-07,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [32]:
df.shape

(10200, 12)

In [33]:
df.columns

Index(['Customer_ID', 'Name', 'Gender', 'Age', 'City', 'Signup_Date',
       'Last_Purchase_Date', 'Purchase_Amount', 'Feedback_Score', 'Email',
       'Phone_Number', 'Country'],
      dtype='object')

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10200 entries, 0 to 10199
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9177 non-null   object
 1   Name                10200 non-null  object
 2   Gender              9174 non-null   object
 3   Age                 9249 non-null   object
 4   City                9184 non-null   object
 5   Signup_Date         10200 non-null  object
 6   Last_Purchase_Date  9188 non-null   object
 7   Purchase_Amount     9179 non-null   float64
 8   Feedback_Score      9177 non-null   float64
 9   Email               10200 non-null  object
 10  Phone_Number        10200 non-null  int64
 11  Country             9468 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 956.4+ KB

In [35]:
df[['Customer_ID', 'Name', 'City', 'Purchase_Amount']]

      Customer_ID               Name         City  Purchase_Amount
0        CUST4371        Paul Wilson     KOLKATA           26944.0
1        CUST5957       Jason Thomas          NaN          44152.0
2        CUST3754  Brittney Martinez   hyderabad           31745.0
3        CUST2934      Brenda Pierce   hyderabad           39674.0
4        CUST5683    Matthew Carroll     CHENNAI               NaN
...           ...                ...          ...              ...
10195   CUST10767       Robert Lewis       delhi           24167.0
10196         NaN        Diane Evans   bangalore           11639.0
10197    CUST6315    Joshua Martinez   hyderabad           43832.0
10198    CUST4812       Sarah Miller          NaN          18827.0
10199    CUST6588       David Potter   HYDERABAD           35211.0

[10200 rows x 4 columns]

In [36]:
df[df['City'] == 'CHENNAI']

Empty DataFrame
Columns: [Customer_ID, Name, Gender, Age, City, Signup_Date, Last_Purchase_Date, Purchase_Amount, Feedback_Score, Email, Phone_Number, Country]
Index: []

In [37]:
df[df['Country'] == 'India']

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
6,CUST3651,Laura Vincent,male,18.0,BANGALORE,2024-06-16,2025-04-25,NaN,3.0,ymiranda@example.net,6917110630,India
8,CUST5189,Sabrina Miller,F,40.0 years,CHENNAI,2025-07-07,2024-10-30,NaN,10.0,shepardcolton@example.net,6233441825,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,delhi,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26.0,kolkata,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [38]:
df[df['Purchase_Amount'] > 30000]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
10,CUST3260,Jason Mack,MALE,32.0,HYDERABAD,2024-08-14,2025-01-20,48115.0,8.0,campbellrobert@example.com,8366856220,India
13,CUST7740,Jose Gross,female,22.0,Mumbai,2023-10-14,2025-04-24,41323.0,2.0,heather45@example.net,5890325488,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,delhi,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26.0,kolkata,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [39]:
df['Gender'].value_counts()

Gender
f         1184
M         1171
m         1163
F         1157
MALE      1131
female    1128
male      1121
FEMALE    1119
Name: count, dtype: int64

In [40]:
df.isnull().sum()

Customer_ID           1023
Name                     0
Gender                1026
Age                    951
City                  1016
Signup_Date              0
Last_Purchase_Date    1012
Purchase_Amount       1021
Feedback_Score        1023
Email                    0
Phone_Number             0
Country                732
dtype: int64

In [41]:
df[df['Purchase_Amount'].isnull()]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
6,CUST3651,Laura Vincent,male,18.0,BANGALORE,2024-06-16,2025-04-25,NaN,3.0,ymiranda@example.net,6917110630,India
8,CUST5189,Sabrina Miller,F,40.0 years,CHENNAI,2025-07-07,2024-10-30,NaN,10.0,shepardcolton@example.net,6233441825,India
11,CUST8028,Mrs. Amy Sharp,F,32.0,HYDERABAD,2021-11-03,2025-07-09,NaN,8.0,shannon26@example.org,7022900906,IND
19,NaN,Jennifer Santos,MALE,26.0 years,MUMBAI,2022-11-14,2025-07-08,NaN,4.0,figueroaaaron@example.net,2241159195,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10131,CUST4058,Ryan Myers,female,25.0,CHENNAI,2021-05-29,2024-12-12,NaN,3.0,amberbaker@example.org,1072319959,India
10144,CUST3384,Austin Green,NaN,32.0,Delhi,2025-04-11,2025-02-04,NaN,2.0,marshalljoshua@example.com,1916136641,India
10152,CUST3085,Sharon Lester,M,57.0,Chennai,2024-03-14,2025-06-28,NaN,6.0,paulaperez@example.com,1206255280,India
10153,CUST4094,Francisco Gonzalez,FEMALE,28.0,Bangalore,2024-02-08,2025-07-12,NaN,5.0,iwood@example.net,635244827,IND
10190,CUST7396,Stanley Le,F,38.0,Hyderabad,2024-02-11,2024-10-10,NaN,1.0,rhondamora@example.com,8321075360,India

In [42]:
avg_purchase = df['Purchase_Amount'].mean()
df['Purchase_Amount'].fillna(avg_purchase, inplace=True)

/tmp/ipython-input-2307283317.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Purchase_Amount'].fillna(avg_purchase, inplace=True)

In [43]:
df['City'].isnull().sum()

np.int64(1016)

In [44]:
df.dropna(subset=['Age'], inplace=True)

In [45]:
df['Gender'] = df['Gender'].str.upper()

df['Gender'] = df['Gender'].replace({
    'M': 'Male',
    'F': 'Female'
})

In [46]:
df['City'] = df['City'].str.upper().str.strip()

In [47]:
df['Country'] = 'India'

In [48]:
df['Signup_Date'] = pd.to_datetime(df['Signup_Date'])

In [49]:
df['Last_Purchase_Date'] = pd.to_datetime(df['Last_Purchase_Date'])

In [50]:
df['Purchase_Amount'].mean()

np.float64(29484.69526441769)

In [51]:
df.groupby('City')['Purchase_Amount'].mean()

City
BANGALORE    32755.797316
CHENNAI      24507.864251
DELHI        25448.294662
HYDERABAD    25584.568700
KOLKATA      31740.903061
MUMBAI       39573.782296
Name: Purchase_Amount, dtype: float64

In [52]:
df['City'].value_counts()

City
MUMBAI       1409
KOLKATA      1405
BANGALORE    1395
CHENNAI      1389
DELHI        1360
HYDERABAD    1356
Name: count, dtype: int64

In [53]:
overall_avg = df['Purchase_Amount'].mean()
df[df['Purchase_Amount'] > overall_avg]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
1,CUST5957,Jason Thomas,Male,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,India
2,CUST3754,Brittney Martinez,Female,62.0,HYDERABAD,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,HYDERABAD,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,India
10,CUST3260,Jason Mack,MALE,32.0,HYDERABAD,2024-08-14,2025-01-20,48115.0,8.0,campbellrobert@example.com,8366856220,India
13,CUST7740,Jose Gross,FEMALE,22.0,MUMBAI,2023-10-14,2025-04-24,41323.0,2.0,heather45@example.net,5890325488,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,DELHI,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,F,26.0,KOLKATA,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,F,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,M,25.0,HYDERABAD,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,FEMALE,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [54]:
overall_avg = df['Purchase_Amount'].mean()
df['Customer_Type'] = df['Purchase_Amount'].apply(
    lambda x: 'High Value' if x > overall_avg else 'Regular'
)